'''
----------------------------------------------
[BOJ] 2754. 학점계산
----------------------------------------------
Link: https://www.acmicpc.net/problem/2754
Tag: py
Memo:
    딕셔너리 자료 검색과 소수점 출력 포메팅
----------------------------------------------
'''

# 평점 매핑 딕셔너리
grade_to_gpa = {
    'A+': 4.3,
    'A0': 4.0,
    'A-': 3.7,
    'B+': 3.3,
    'B0': 3.0,
    'B-': 2.7,
    'C+': 2.3,
    'C0': 2.0,
    'C-': 1.7,
    'D+': 1.3,
    'D0': 1.0,
    'D-': 0.7,
    'F': 0.0
}

# 성적 입력 받기
grade = input().strip()

# 성적에 따라 평점 출력
print(f"{grade_to_gpa[grade]:.1f}")
